{"class_name": "Model", "config": {"name": "model_21", "layers": [{"name": "input_61", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "input_61"}, "inbound_nodes": []}, {"name": "input_62", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "int32", "sparse": false, "name": "input_62"}, "inbound_nodes": []}, {"name": "embedding_41", "class_name": "Embedding", "config": {"name": "embedding_41", "trainable": false, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 5002, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["input_61", 0, 0, {}]]]}, {"name": "embedding_42", "class_name": "Embedding", "config": {"name": "embedding_42", "trainable": false, "batch_input_shape": [null, 10], "dtype": "float32", "input_dim": 5002, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 10}, "inbound_nodes": [[["input_62", 0, 0, {}]]]}, {"name": "dropout_157", "class_name": "Dropout", "config": {"name": "dropout_157", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_41", 0, 0, {}]]]}, {"name": "dropout_161", "class_name": "Dropout", "config": {"name": "dropout_161", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_42", 0, 0, {}]]]}, {"name": "lstm_117", "class_name": "LSTM", "config": {"name": "lstm_117", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_157", 0, 0, {}]]]}, {"name": "lstm_120", "class_name": "LSTM", "config": {"name": "lstm_120", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_161", 0, 0, {}]]]}, {"name": "dropout_158", "class_name": "Dropout", "config": {"name": "dropout_158", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_117", 0, 0, {}]]]}, {"name": "dropout_162", "class_name": "Dropout", "config": {"name": "dropout_162", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_120", 0, 0, {}]]]}, {"name": "lstm_118", "class_name": "LSTM", "config": {"name": "lstm_118", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_158", 0, 0, {}]]]}, {"name": "lstm_121", "class_name": "LSTM", "config": {"name": "lstm_121", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_162", 0, 0, {}]]]}, {"name": "dropout_159", "class_name": "Dropout", "config": {"name": "dropout_159", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_118", 0, 0, {}]]]}, {"name": "dropout_163", "class_name": "Dropout", "config": {"name": "dropout_163", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_121", 0, 0, {}]]]}, {"name": "lstm_119", "class_name": "LSTM", "config": {"name": "lstm_119", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_159", 0, 0, {}]]]}, {"name": "lstm_122", "class_name": "LSTM", "config": {"name": "lstm_122", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_163", 0, 0, {}]]]}, {"name": "input_63", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "input_63"}, "inbound_nodes": []}, {"name": "dropout_160", "class_name": "Dropout", "config": {"name": "dropout_160", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_119", 0, 0, {}]]]}, {"name": "dropout_164", "class_name": "Dropout", "config": {"name": "dropout_164", "trainable": true, "rate": 0.33317964196180044, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_122", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_63", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_160", 0, 0, {}], ["dropout_164", 0, 0, {}], ["dense_95", 0, 0, {}]]]}, {"name": "dense_96", "class_name": "Dense", "config": {"name": "dense_96", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_96", 0, 0, {}]]]}, {"name": "dense_98", "class_name": "Dense", "config": {"name": "dense_98", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_97", 0, 0, {}]]]}], "input_layers": [["input_61", 0, 0], ["input_62", 0, 0], ["input_63", 0, 0]], "output_layers": [["dense_98", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}